#ifndef DRAWER_H_
#define DRAWER_H_

/****************************************************
	header
*****************************************************/
#include "GlobalObject.h"

/*
	描画クラス
*/
class Drawer
{
public:
	/****************************************************
		コンストラクタ
	*****************************************************/
	Drawer();

	/****************************************************
		デストラクタ
	*****************************************************/
	~Drawer()
	{}

	/****************************************************
		バッファのクリア関数
	*****************************************************/
	void ClearBuffer();

	/****************************************************
		バッファに書き込む関数
	*****************************************************/
	void WriteBuffer(float posX_, float posY_, __int8 objectType_);

	/****************************************************
		バッファに書き込む関数
	*****************************************************/
	void WriteBuffer(float posX_, float posY_, float width_, float height_, __int8 objectType_);

	/****************************************************
		バッファの描画関数
	*****************************************************/
	void DrawBuffer();

private:
	
	// 描画用バッファ
	__int8 m_DrawBuffer[STAGE_HEIGHT][STAGE_WIDTH];

	// クリア用バッファ
	__int8 m_ClearBuffer[STAGE_HEIGHT][STAGE_WIDTH];

};

#endif