#ifndef YAMANOTELINEDB_H_
#define YAMANOTELINEDB_H_

// 山手線の駅の数
#define YAMANOTE_STATION_NUM	29

// 中央線の駅の数
#define CHUO_STATION_NUM        38

// 駅の名前の最大文字数
#define MAX_STATION_NAME_LENGTH 32

/*
	駅構造体
*/
struct Station
{
	// 駅のID
	__int8 m_StationId;

	// 駅名
	char   m_StationName[MAX_STATION_NAME_LENGTH];

	// 次の駅までのコスト, 単位 -> 分

	__int8 m_NextStationCost;
};

// 山手線DB
const Station g_YamanoteDB[YAMANOTE_STATION_NUM] =
{
	//	ID		駅名	     右のコスト
		{1,		"駒込",			2},
		{2,		"田端",			2},
		{3,		"西日暮里",		1},
		{4,		"日暮里",	    2},
		{5,		"鶯谷",			2},
		{6,		"上野",			2},
		{7,		"御徒町",	    2},
		{8,		"秋葉原",	    2},
		{9,		"神田",			1},
		{10,	"東京",			2},
		{11,	"有楽町",	    2},
		{12,	"新橋",			2},
		{13,	"浜松町",	    2},
		{14,	"田町",			2},
		{15,	"品川",			3},
		{16,	"大崎",			2},
		{17,	"五反田",	    2},
		{18,	"目黒",			3},
		{19,	"恵比寿",	    2},
		{20,	"渋谷",			2},
		{21,	"原宿",			2},
		{22,	"代々木",	    2},
		{23,	"新宿",			2},
		{24,	"新大久保",		2},
		{25,	"高田馬場",		2},
		{26,	"目白",			3},
		{27,	"池袋",			2},
		{28,	"大塚",			2},
		{29,	"巣鴨",			2},
};


// 中央線DB
const Station g_ChuoLine[CHUO_STATION_NUM] =
{
	//	ID		駅名	     右のコスト
		{30,	"三鷹",			3},
		{31,	"吉祥寺",		2},
		{32,	"西荻窪",		3},
		{33,	"荻窪",			2},
		{34,	"阿佐ヶ谷",		2},
		{35,	"高円寺",		3},
		{36,	"中野",			3},
		{37,	"東中野",		2},
		{38,	"大久保",		2},
		{23,	"新宿",			2},
		{22,	"代々木",		2},
		{39,	"千駄ケ谷",		2},
		{40,	"信濃町",		2},
		{41,	"四ツ谷",		2},
		{42,	"市ケ谷",		2},
		{43,	"飯田橋",		2},
		{44,	"水道橋",		2},
		{45,	"御茶ノ水",		2},
		{8,		"秋葉原",		2},
		{46,	"浅草橋",		2},
		{47,	"両国",			2},
		{48,	"錦糸町",		2},
		{49,	"亀戸",			2},
		{50,	"糸井",			2},
		{51,	"新小岩",		2},
		{52,	"小岩",			2},
		{53,	"市川",			2},
		{54,	"本八幡",		2},
		{55,	"下総中山",		2},
		{56,	"船橋",			2},
		{57,	"東船橋",		2},
		{58,	"津田沼",		2},
		{59,	"幕張本郷",		2},
		{60,	"幕張",			2},
		{61,	"新検見川",		2},
		{62,	"稲毛",			2},
		{63,	"西千葉",		2},
		{64,	"千葉",			2},
};

#endif